Massing cannot be created with a curtain roof. Please change the default roof type and try again.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoCurtainRoofsInMassing { get; }
  Visual Basic
Public Shared ReadOnly Property NoCurtainRoofsInMassing As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoCurtainRoofsInMassing {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MassFailures Class
  Autodesk.Revit.DB Namespace